"""
_______________________________________________________________
int - целое число
float - Дробные числа
bool  - Логический тип данных (True/False)
str - Строка
_______________________________________________________________

print(type(name)) - функция, которая указывает на тип данных

________________________________________________________________

Используйте разные кавычки для объявления переменной и внутри строки:
s = 'hello "world"'
s = "hello 'world'"
s = 'hello \"world'
_____________________________________________________________________

интерполяция
a = 3
b = 11
s = 2022
print(a, b, s)
print(a,'-'b,'-'s)
print('{} - {} - {}'.format(a,b,s))
print(f'first - {a} second - {b} third - {s}')
____________________________________________________________________

Приоритет арифметических операций
1. Возведение в степень (**)
2. Умножение (*)
3. Деление (/)
4. Целочисленное деление (//)
5. Остаток от деления (%)
6. Сложение (+)
7. Вычитание (-)
__________________________________________________________________

Округление числа
Можно указать количество знаков после запятой
a = 1.43425
b = 2.2983
c = round(a * b, 5) # 3,29633
____________________________________________________________________
Сокращенные операции присваивания
Помните в C# внутри цикла for мы писали i++. Это было сокращение от i = i + 1.
Посмотри как можно сокращать операторы присваивания в Python
iter = 2
iter += 3 # iter = iter + 3
iter -= 4 # iter = iter - 4
iter *= 5 # iter = iter * 5
iter /= 5 # iter = iter / 5
iter //= 5 # iter = iter // 5
iter %= 5 # iter = iter % 5
iter **= 5 # iter = iter ** 5
_____________________________________________________________________________
"""

# print("Введите 1-е число ")
# a = input()
# print(type(a))
# print("Введите 2-е число ")
# b = input()
# print(type(b))
# # sum = int(a) + int(b)
# # print(f"{a} + {b} = {sum}")
# print(f"{a} + {b} = {int(a) + int(b)}")
# print(type(print))

# a = 4.56952
# b = 5.5456
# print(round(a*b, 2)) 

# username = input("введите Ваше имя: ")
# if username == "Маша":
#     print("Ура! Маша")
# elif username == "Ира":
#     print("Привет Ира")
# elif username == "Катя":
#     print("Катюха! Ты ли это?)")
# else:
#     print("Привет,", username)
